#импортируем node для запуска и сборки js файла (внутри уже есть линукс на котором запускается контейнер)
FROM node:21
#указываем имя рабочей директории которая буде создана на виртуальном сервере
WORKDIR /app
#копируем туда файл пакетов
COPY package*.json ./
#устанавливаем модули
RUN npm install
#копируем оставшиеся файлы
COPY . ./
#задаем глобальную переменную
ENV PORT 3000
#указываем порт 3000
EXPOSE $PORT
#команда которая будет использоваться при запуске контейнера
CMD ["npm", "run", "start"]
